const categories = {

  history: [

    {
      q: "В каком году началась Вторая мировая война?",
      a: ["1914", "1939", "1945", "1920"],
      correct: 1
    },
    {
      q: "Кто был первым президентом США?",
      a: ["Линкольн", "Вашингтон", "Джефферсон", "Рузвельт"],
      correct: 1
    },
    {
      q: "Где были построены пирамиды?",
      a: ["Греция", "Египет", "Рим", "Китай"],
      correct: 1
    },
    {
      q: "Кто открыл Америку?",
      a: ["Магеллан", "Колумб", "Васко да Гама", "Кук"],
      correct: 1
    },
    {
      q: "Где находился центр Римской империи?",
      a: ["Афины", "Рим", "Париж", "Лондон"],
      correct: 1
    },
    {
      q: "Когда была Французская революция?",
      a: ["1789", "1812", "1600", "1905"],
      correct: 0
    },
    {
      q: "Кто был Наполеон?",
      a: ["Король Англии", "Французский император", "Сенатор Рима", "Царь России"],
      correct: 1
    },
    {
      q: "Где появилась демократия?",
      a: ["Рим", "Греция", "Египет", "Индия"],
      correct: 1
    },
    {
      q: "Что такое Средневековье?",
      a: ["Будущее", "Исторический период", "Война", "Империя"],
      correct: 1
    },
    {
      q: "Кто изобрёл печатный станок?",
      a: ["Гутенберг", "Ньютон", "Да Винчи", "Галилей"],
      correct: 0
    },
    {
      q: "Когда пала Римская империя?",
      a: ["476", "1066", "1492", "1200"],
      correct: 0
    },
    {
      q: "Кто был Юлий Цезарь?",
      a: ["Учёный", "Римский политик", "Художник", "Фараон"],
      correct: 1
    },
    {
      q: "Где находится Великая Китайская стена?",
      a: ["Япония", "Китай", "Корея", "Индия"],
      correct: 1
    },
    {
      q: "Что такое холодная война?",
      a: ["Война без оружия", "Конфликт США и СССР", "Средневековая война", "Гражданская война"],
      correct: 1
    },
    {
      q: "Кто был Гитлер?",
      a: ["Президент США", "Лидер Германии", "Король Англии", "Учёный"],
      correct: 1
    },
    {
      q: "Когда человек впервые полетел в космос?",
      a: ["1955", "1961", "1970", "1980"],
      correct: 1
    },
    {
      q: "Где началась индустриальная революция?",
      a: ["Франция", "Англия", "США", "Германия"],
      correct: 1
    },
    {
      q: "Что такое колонизация?",
      a: ["Торговля", "Захват земель", "Религия", "Наука"],
      correct: 1
    },
    {
      q: "Кто открыл теорию относительности?",
      a: ["Ньютон", "Эйнштейн", "Галилей", "Тесла"],
      correct: 1
    },
    {
      q: "Кто был первым римским императором?",
      a: ["Август", "Нерон", "Цезарь", "Траян"],
      correct: 0
    }

  ],

  games: [

    {
      q: "Кто создал Minecraft?",
      a: ["Notch", "Valve", "Rockstar", "EA"],
      correct: 0
    },
    {
      q: "В какой игре есть Creeper?",
      a: ["Fortnite", "Minecraft", "Roblox", "Terraria"],
      correct: 1
    },
    {
      q: "Что такое FPS?",
      a: ["Жанр", "Кадры в секунду", "Оружие", "Карта"],
      correct: 1
    },
    {
      q: "Какая компания сделала GTA?",
      a: ["Ubisoft", "Rockstar Games", "EA", "Valve"],
      correct: 1
    },
    {
      q: "Что такое RPG?",
      a: ["Графика", "Жанр", "Мод", "Карта"],
      correct: 1
    },
    {
      q: "В какой игре есть Ender Dragon?",
      a: ["Minecraft", "Skyrim", "PUBG", "CS:GO"],
      correct: 0
    },
    {
      q: "Что такое NPC?",
      a: ["Игрок", "Неигровой персонаж", "Оружие", "Карта"],
      correct: 1
    },
    {
      q: "Что делает игровой движок?",
      a: ["Музыку", "Создаёт игры", "Интернет", "Только графику"],
      correct: 1
    },
    {
      q: "Что такое лаг?",
      a: ["Ошибка графики", "Задержка", "Урон", "Мод"],
      correct: 1
    },
    {
      q: "Какая игра Battle Royale?",
      a: ["CS:GO", "Fortnite", "Minecraft", "Sims"],
      correct: 1
    },
    {
      q: "Что такое DLC?",
      a: ["Ошибка", "Доп. контент", "Режим", "Карта"],
      correct: 1
    },
    {
      q: "В какой игре есть лутбоксы?",
      a: ["Overwatch", "Tetris", "Doom", "Pac-Man"],
      correct: 0
    },
    {
      q: "Что такое сервер?",
      a: ["Компьютер", "Хост игры", "Мод", "Графика"],
      correct: 1
    },
    {
      q: "Что такое скин?",
      a: ["Карта", "Внешний вид", "Оружие", "Ошибка"],
      correct: 1
    },
    {
      q: "Кто делает PlayStation?",
      a: ["Microsoft", "Sony", "Nintendo", "Sega"],
      correct: 1
    },
    {
      q: "Что такое sandbox игра?",
      a: ["Линейная", "Открытый мир", "Стратегия", "Шутер"],
      correct: 1
    },
    {
      q: "Что такое hitbox?",
      a: ["Музыка", "Зона попадания", "Карта", "Мод"],
      correct: 1
    },
    {
      q: "Что делает AI в играх?",
      a: ["Музыку", "Поведение врагов", "Графику", "Интернет"],
      correct: 1
    },
    {
      q: "Какая компания создала DOOM?",
      a: ["Valve", "id Software", "Ubisoft", "Nintendo"],
      correct: 1
    },
    {
      q: "Что такое Unity?",
      a: ["Игра", "Движок", "Консоль", "Мод"],
      correct: 1
    }

  ],

  music: [

    {
      q: "Кто написал Bohemian Rhapsody?",
      a: ["The Beatles", "Queen", "Led Zeppelin", "Pink Floyd"],
      correct: 1
    },
    {
      q: "Инструмент Джими Хендрикса?",
      a: ["Бас", "Скрипка", "Гитара", "Саксофон"],
      correct: 2
    },
    {
      q: "Жанр Metallica?",
      a: ["Pop", "Jazz", "Metal", "Reggae"],
      correct: 2
    },
    {
      q: "Сколько нот в октаве?",
      a: ["5", "7", "8", "12"],
      correct: 3
    },
    {
      q: "Кто написал Moonlight Sonata?",
      a: ["Моцарт", "Бетховен", "Бах", "Шопен"],
      correct: 1
    },
    {
      q: "Стиль DOOM OST?",
      a: ["EDM", "Jazz", "Industrial Metal", "Classical"],
      correct: 2
    },
    {
      q: "Что такое BPM?",
      a: ["Бас", "Темп", "Инструмент", "Микрофон"],
      correct: 1
    },
    {
      q: "Высокий женский голос?",
      a: ["Бас", "Тенор", "Альт", "Сопрано"],
      correct: 3
    },
    {
      q: "DAW программа?",
      a: ["Photoshop", "FL Studio", "Blender", "Unity"],
      correct: 1
    },
    {
      q: "Что такое реверберация?",
      a: ["Инструмент", "Эхо эффект", "Нота", "Темп"],
      correct: 1
    },
    {
      q: "Стиль Led Zeppelin?",
      a: ["Punk", "Rock", "Techno", "Disco"],
      correct: 1
    },
    {
      q: "Сколько струн у гитары?",
      a: ["4", "5", "6", "12"],
      correct: 2
    },
    {
      q: "Что такое аккорд?",
      a: ["Нота", "Набор нот", "Темп", "Эффект"],
      correct: 1
    },
    {
      q: "Кто написал Imagine?",
      a: ["John Lennon", "Elvis", "Mercury", "Cobain"],
      correct: 0
    },
    {
      q: "Что такое бит?",
      a: ["Тон", "Ритм", "Эффект", "Октава"],
      correct: 1
    },
    {
      q: "Инструмент в оркестре?",
      a: ["Гитара", "Скрипка", "Синтезатор", "Барабаны ПК"],
      correct: 1
    },
    {
      q: "Что такое тональность?",
      a: ["Громкость", "Лад", "Эхо", "Ритм"],
      correct: 1
    },
    {
      q: "Рок-группа?",
      a: ["Daft Punk", "Nirvana", "Skrillex", "Avicii"],
      correct: 1
    },
    {
      q: "Что делает компрессор?",
      a: ["Громкость ↑", "Сжимает динамику", "Эхо", "Темп"],
      correct: 1
    },
    {
      q: "Что такое MIDI?",
      a: ["Видео", "Музыкальный протокол", "Микрофон", "Эффект"],
      correct: 1
    }

  ]

};
